config/ext/Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлиентSLA</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОтчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПлан</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительПроекта</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПлан</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаПроект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИнициаторЗадания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПроекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РСК_ТипыПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЧекЛист</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сервисы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сервис</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Сервисы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПроектнаяГруппа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИнициаторЗадания</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/ext/Enums/РСК_ТипыПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>РСК_ТипыПроектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сопровождение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/ext/Catalogs/Проекты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//++ Горохов И. 31.05.21 Задача №7054
&НаСервере
Процедура РСК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Клиент") Тогда
		Объект.Клиент = Параметры.Клиент;
	ИначеЕсли Параметры.ПараметрыВыбора.Свойство("Клиент") тогда
		Объект.Клиент = Параметры.ПараметрыВыбора.Клиент;
		Объект.Родитель = Неопределено;
	КонецЕсли;	
	
	//Если Параметры.Свойство("Родитель") Тогда
	//	Объект.Родитель = Параметры.Родитель;
	//КонецЕсли;
	
	//Объект.РуководительПроекта 	= ПользователиКлиентСервер.ТекущийПользователь();
	//Объект.ДатаНачала 			= Дата("00010101");
	//Объект.ДатаНачалаПлан 		= Дата("00010101");
	//Объект.ДатаОкончания		= Дата("00010101");
	//Объект.ДатаОкончанияПлан 	= Дата("00010101");
	//Объект.Статус = Перечисления.СтатусыПроекта.ВРаботе;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задание.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Задание КАК Задание
		|ГДЕ
		|	Задание.Проект = &Проект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Задание.Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Проект", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Стр = ТабЗадачи.Добавить();
			Стр.Задача = ВыборкаДетальныеЗаписи.Ссылка;
			ТабИсполнители = ВыборкаДетальныеЗаписи.Ссылка.Исполнители;
			СтрИсполнитель = "";
			МассивДобавленных = Новый Массив;
			Для каждого Запись из ТабИсполнители цикл
				Если МассивДобавленных.Найти(Запись.Исполнитель) = Неопределено тогда
					МассивДобавленных.Добавить(Запись.Исполнитель);
				Иначе
					Продолжить;
				КонецЕсли;
				СтрИсполнитель = СтрИсполнитель + Строка(Запись.Исполнитель) +";";		
			КонецЦикла;
			Стр.Исполнитель = СтрИсполнитель;
		КонецЦикла;	
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() или НЕ ЗначениеЗаполнено(Объект.ТипПроекта) Тогда
		Объект.ТипПроекта = Перечисления.РСК_ТипыПроектов.Сопровождение;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура РСК_Клиент1НачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТипСтр = "СправочникСсылка.Контрагенты";
    Элемент.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
    Значение = Объект.Клиент;
    Объект.Клиент = Элемент.ОграничениеТипа.ПривестиЗначение(Значение);
    Элемент.ВыбиратьТип = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура РСК_ПриОткрытииПосле(Отказ)
	//УстановитьТекущуюСтраницу();  // Макаров СА. убрал, что за бред открывать не главную страницу сразу.
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтраницу()
	Если НЕ Объект.Ссылка = Справочники.Проекты.ПустаяСсылка() тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.Задачи;	
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура РСК_ТабЗадачиВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
 	ПоказатьЗначение(,ТабЗадачи[ЭтаФорма.Элементы.ТабЗадачи.ТекущаяСтрока].Задача);
КонецПроцедуры


&НаКлиенте 
Процедура УправлениеВидимостью()
	Элементы.ОтветственныйЗаОтчет1.Видимость= НЕ(Объект.ТипПроекта = ПредопределенноеЗначение("Перечисление.РСК_ТипыПроектов.Проект"));
	Элементы.РуководительПроекта1.Заголовок = ?(Объект.ТипПроекта = ПредопределенноеЗначение("Перечисление.РСК_ТипыПроектов.Проект"),"Руководитель проекта","Менеджер сопровождения");
КонецПроцедуры
&НаКлиенте
Процедура РСК_ТипПроектаПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
	УправлениеВидимостью();
КонецПроцедуры
//-- Конец задачи №7054
